# HelpId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DialogBoxData..::..HelpId Property
DialogBoxData Class See Also
---
An ID that represents the dialog that has been displayed.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int HelpId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HelpId As Integer
	Get
```

Visual C++
---
```text
public:
property int HelpId {
	int get ();
}
```

# Remarks
Use this ID within your application to key suitable responses for the dialog. Note: this id is not guaranteed to remain stable for different builds of Autodesk Revit.
# See Also
DialogBoxData Class
Autodesk.Revit.UI.Events Namespace